
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  УстановитьПараметр();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	СкомпоноватьРезультат();
	Результат.МасштабПечати = 120;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметр()
	
	ОТчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ОсновнаяСхемаКомпоновки = ОТчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ПараметрСкд = ОсновнаяСхемаКомпоновки.НаборыДанных.НаборДанных1.Поля.Найти("Сотрудник");
	
	ПараметрВыбора = ПараметрСкд.ПараметрыРедактирования.Элементы[2];
	НовыйПараметрВыбора = ПараметрВыбора.Значение.Добавить();
	
	НовыйПараметрВыбора.Имя = "Отбор.Подразделение";
	
	МаасивЭлем = Новый Массив();
	МаасивЭлем.Добавить(ПараметрыСеанса.ТекущийПользователь.Подразделение);
	
	НовыйПараметрВыбора.Значение = МаасивЭлем;
	ПараметрВыбора.Использование = Истина;
	
	АдресСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновки, Новый УникальныйИдентификатор());
	
	ОТчетОбъект.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	ОТчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(ОсновнаяСхемаКомпоновки.НастройкиПоУмолчанию);
	
	ЗначениеВРеквизитФормы(ОТчетОбъект, "Отчет");
КонецПроцедуры
