&НаСервере
Функция ПолучитьРаботу(ДокументСсылка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРемонт.ОписаниеПроблемы КАК Работа
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЗаявкаНаРемонт.Ссылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат СокрЛП(ВыборкаДетальныеЗаписи.Работа);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ПолучитьВыполненыеРаботы()
	
	Макет = Отчеты.ФактическиОтработаноеВремя.ПолучитьМакет("СписокРабот");
	
	ДокументПечати = Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.СтрокаПериод = СтрШаблон("%1 - %2",Формат(Отчет.ПериодОтчета.ДатаНачала,"ДЛФ=D"),Формат(Отчет.ПериодОтчета.ДатаОкончания,"ДЛФ=D"));
	ДокументПечати.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрВыполненыхРабот.ВыполнившийСотрудник КАК Сотрудник,
		|	РегистрВыполненыхРабот.ДатаВыполнения КАК ДатаВыполнения,
		|	РегистрВыполненыхРабот.КоличествоЧасов КАК КоличествоЧасов,
		|	РегистрВыполненыхРабот.КоличествоМинут КАК КоличествоМинут,
		|	РегистрВыполненыхРабот.Регистратор КАК Регистратор,
		|	РегистрВыполненыхРабот.ДатаПринятия КАК ДатаПринятия
		|ИЗ
		|	РегистрСведений.РегистрВыполненыхРабот КАК РегистрВыполненыхРабот
		|ГДЕ
		|	РегистрВыполненыхРабот.Период МЕЖДУ &ПериодС И &ПериодПо";
	
	Запрос.УстановитьПараметр("ПериодС",Отчет.ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодПо",Отчет.ПериодОтчета.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ИтогоКоличествоЧасов = 0; ИтогоКоличествоМинут = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаСтруктруа = Новый Структура;
		СтрокаСтруктруа.Вставить("Сотрудник",ОбщийСправочникиКлиентСервер.ФамилияИнициалы(ВыборкаДетальныеЗаписи.Сотрудник,,,,Истина));
		СтрокаСтруктруа.Вставить("Работа",ПолучитьРаботу(ВыборкаДетальныеЗаписи.Регистратор));
		ДатаПринятия = Формат(ВыборкаДетальныеЗаписи.ДатаПринятия,"ДЛФ=D");
		ДатаВыполнения = Формат(ВыборкаДетальныеЗаписи.ДатаВыполнения,"ДЛФ=D");
		Если ДатаПринятия=ДатаВыполнения Тогда
			СтрокаСтруктруа.Вставить("ДатаВыполнения",ДатаВыполнения);
		Иначе
			СтрокаСтруктруа.Вставить("ДатаВыполнения",СтрШаблон("%1 - %2",ДатаПринятия,ДатаВыполнения));
		КонецЕсли;
		СтрокаСтруктруа.Вставить("ЗатраченоеВремя",СтрШаблон("%1:%2",
											Формат(ВыборкаДетальныеЗаписи.КоличествоЧасов,"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0"),
											Формат(ВыборкаДетальныеЗаписи.КоличествоМинут,"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0")));
		ОбластьСтрока.Параметры.Заполнить(СтрокаСтруктруа);
		ДокументПечати.Вывести(ОбластьСтрока);
		ИтогоКоличествоЧасов = ИтогоКоличествоЧасов+ВыборкаДетальныеЗаписи.КоличествоЧасов;
		ИтогоКоличествоМинут = ИтогоКоличествоМинут+ВыборкаДетальныеЗаписи.КоличествоМинут;
	КонецЦикла;
	
	СтруктураПодвал = Новый Структура;
	ПолныхЧасов = Цел(ИтогоКоличествоМинут/60);
	ПолныхМинут = ИтогоКоличествоМинут-(ПолныхЧасов*60);
	ПолныхЧасов = ПолныхЧасов+ИтогоКоличествоЧасов;
	СтруктураПодвал.Вставить("ИтогоВремя",СтрШаблон("%1 ч. %2 мин.",
										Формат(ПолныхЧасов,"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0"),
										Формат(ПолныхМинут,"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0")));
	ОбластьПодвал.Параметры.Заполнить(СтруктураПодвал);
	ДокументПечати.Вывести(ОбластьПодвал);
	
	Возврат ДокументПечати;
	
КонецФункции


&НаКлиенте
Процедура Сформировать(Команда)
	
	ДокументПечати = ПолучитьВыполненыеРаботы();
	ДокументПечати.Показать();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПрошлыйМесяц;
	
КонецПроцедуры

