
&НаКлиенте
Процедура ПрограммныеПродуктыЦенаПриИзменении(Элемент)
	
	ПрограммныеПродуктыПересчетСтроки(Элементы.ПрограммныеПродукты.ТекущаяСтрока);

КонецПроцедуры

&НаСервере
Процедура ПрограммныеПродуктыПересчетСтроки(ИДстроки)
	
	ПересчетСтроки(Объект.ПрограммныеПродукты.НайтиПоИдентификатору(ИДСтроки));
	
КонецПроцедуры	

&НаКлиенте
Процедура ПрограммныеПродуктыКоличествоПриИзменении(Элемент)
	
	ПрограммныеПродуктыПересчетСтроки(Элементы.ПрограммныеПродукты.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммныеПродуктыНДСПриИзменении(Элемент)
	
	ПрограммныеПродуктыПересчетСтроки(Элементы.ПрограммныеПродукты.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ПрограммныеПродуктыУстановитьСтавкуНДС(ИДстроки)
	
	УстановитьСтавкуНДС(Объект.ПрограммныеПродукты.НайтиПоИдентификатору(ИдСтроки));
	
КонецПроцедуры	

&НаСервере
Процедура ПрограммныеПродуктыУстановитьКоличество(ИДСтроки)
	
	ТекущаяСтрока = Объект.ПрограммныеПродукты.НайтиПоИдентификатору(ИДстроки);
	ТекущаяСтрока.Количество = 1;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПрограммныеПродуктыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		ПрограммныеПродуктыУстановитьСтавкуНДС(Элемент.ТекущаяСтрока);
		ПрограммныеПродуктыУстановитьКоличество(Элемент.ТекущаяСтрока);
	КонецЕсли;	
	
КонецПроцедуры

