
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СостояниеРемонта.Записывать = Истина;
	Движение = Движения.СостояниеРемонта.Добавить();
	Движение.Период = Дата;
	Движение.Подразделение = Подразделение;
	Движение.Сотрудник = Сотрудник;
	Движение.Кабинет = Кабинет;
	Движение.ОписаниеПроблемы = ОписаниеПроблемы;

	Движения.РегистрВыполненыхРабот.Записывать = Истина;
	Движение = Движения.РегистрВыполненыхРабот.Добавить();
	Движение.Период = Дата;
	Движение.ДатаПринятия = ДатаПринятия;
	Движение.ВыполнившийСотрудник = ВыполнившийСотрудник;
	Движение.ДатаВыполнения = ДатаВыполнения;
	Движение.ОписаниеРешения = ОписаниеРешения;
	Движение.КоличествоЧасов = ФактическиОтработаноеВремяЧасов;
	Движение.КоличествоМинут = ФактическиОтработаноеВремяМинут;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//ЗаписьЖурналаРегистрации("Документ.ЗаявкаНаРемонт",УровеньЖурналаРегистрации.Информация,Ссылка,Ссылка,"Компьютер: "+ИмяКомпьютера());
	
КонецПроцедуры



