
&НаСервере
Процедура ПересчетСтроки(ТекущаяСтрока) Экспорт
	
		
	ТекущаяСтрока.Сумма = Окр(ТекущаяСтрока.Количество * ТекущаяСтрока.Цена,2,1);
	Если ТекущаяСтрока.НДС<>0 Тогда
		ТекущаяСтрока.СуммаСНДС = Окр(ТекущаяСтрока.Сумма*(1+ТекущаяСтрока.НДС/100),2,1);
	Иначе
		ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтавкуНДС(ТекущаяСтрока) Экспорт
	
	ТекущаяСтрока.НДС = Константы.СтавкаНДС.Получить();
	
КонецПроцедуры

