
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстПриОткрытии = Объект.Наименование;
	ЗаписьПолногоНаименования();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьПолногоНаименования()
	
	КоличествоСимволовКороткий = СтрДлина(ТекстПриОткрытии);
	КоличествоСимволовДлинный = СтрДлина(Объект.ПолноеНаименование);
	проб = Лев(Объект.ПолноеНаименование, КоличествоСимволовКороткий);
	СтрокаПравый = "";
	Если Объект.ПолноеНаименование = "" И Не Объект.Наименование = "" Тогда
		
		Объект.ПолноеНаименование = Объект.Наименование;
		
	ИначеЕсли Не Объект.Наименование = проб Тогда 	
		
		СтрокаПравый = Прав(Объект.ПолноеНаименование,(КоличествоСимволовДлинный - КоличествоСимволовКороткий));
		Объект.ПолноеНаименование = СокрП(Объект.Наименование) + " " + СокрЛ(СтрокаПравый);
		ТекстПриОткрытии = Объект.Наименование;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаписьПолногоНаименования();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ЗаписьПолногоНаименования();
КонецПроцедуры
