
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Бот = Константы.Бот.Получить();
	Объект.Токен = Константы.Токен.Получить();
	Объект.Сервер = Константы.Сервер.Получить();
	//ПодключитьОбработчикОжидания("Автомат",5);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеБоту()
	
	
	
КонецПроцедуры	

&НаСервере
Процедура getUpdatesНаСервере()
	
	Результат = SDK_Telegram.ПолучитьСпиокСообщений();
	РезультатЗапроса = SDK_Telegram.СформироватьJSON(Результат,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура getUpdates(Команда)
	getUpdatesНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапускФоновыхЗаданий(Команда)
	
	ПодключитьОбработчикОжидания("Автомат",5);
	
КонецПроцедуры

&НаКлиенте
Процедура Автомат()
	
	getUpdatesНаСервере();
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("Автомат",5);
	
КонецПроцедуры
