&НаСервере
Функция ПолучитьДень(ИсходнаяДата, КоличествоПрибавляемыхДней)
	
	Запрос = Новый("
	|ВЫБРАТЬ 
	|ДОБАВИТЬКДАТЕ(&ИсходнаяДата, ДЕНЬ, &Количество) как Дата");

	Запрос.УстановитьПараметр("ИсходнаяДата", ИсходнаяДата); 
	Запрос.УстановитьПараметр("Количество", КоличествоПрибавляемыхДней); 
	Возврат Запрос.Выполнить().Выгрузить()[0].Дата;
	
КонецФункции

&НаСервере
Функция ПолучитьОписаниеОборудования(Ссылка) Экспорт
	
	Запрос = Новый ("
	|ВЫБРАТЬ
	|	Оборудование.Ссылка КАК Ссылка,
	|	Оборудование.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Оборудование.Наименование КАК Наименование,
	|	Оборудование.Размещение КАК Размещение
	|ИЗ
	|	Справочник.Оборудование КАК Оборудование
	|ГДЕ
	|	Оборудование.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ОборудованиеСсылка = Запрос.Выполнить().Выгрузить();
	
	Возврат "Инв. ном "+ОборудованиеСсылка.ИнвентарныйНомер+" - "+ОборудованиеСсылка.Наименование+" (каб. "+ОборудованиеСсылка.Размещение+")";
КонецФункции


