
Процедура ПриНачалеРаботыСистемы()
	

	Если СтандартныеПодсистемы.ПроверитьРольНаСервере("ТелеграмБот") Тогда
		Попытка
			ФормаТелеграмБота = ПолучитьФорму("Обработка.ТелеграмБот.Форма.Форма");
			ФормаТелеграмБота.Открыть();
			//Обработки.ТелеграмБот.ПолучитьФорму().Открыть();
		Исключение
		КонецПопытки;
	//ИначеЕсли СтандартныеПодсистемы.ПроверитьРольНаСервере("Геология") Тогда
	//	Попытка
	//		ФормаКонвертации = ПолучитьФорму("Обработка.КонвертироватьXMLвEXCEL.Форма.Форма");
	//		ФормаКонвертации.Открыть();
	//	Исключение
	//	КонецПопытки;
	КонецЕсли;
	
	
	//Если СтандартныеПодсистемы.ПроверитьРольНаСервере("Заявка") Тогда
	//	Попытка
	//		//ФормаЗаявки = ПолучитьФорму("Документ.ЗаявкаНаРемонт.Форма.ФормаДокумента");
	//		////ФормаЗаявки = ПолучитьФорму("Документ.Договор.Форма.ФормаСписка");
	//		//ФормаЗаявки.Открыть();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	
	УстановитьЗаголовокПриложения("ОАО ""Полесьегипроводхоз"" // "+ИмяПользователя());
	
КонецПроцедуры