
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры) 
	     УстановитьТеущегоПользователя();
КонецПроцедуры

Процедура УстановитьТеущегоПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Наименование = &ТекущийСотрудник";
	
	Запрос.УстановитьПараметр("ТекущийСотрудник", ИмяПользователя());
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 	
		ПараметрыСеанса.ТекущийПользователь = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		ПараметрыСеанса.ТекущийПользователь = Справочники.Сотрудники.ПустаяСсылка();
		СообщениеПользователю = Новый СообщениеПользователю();
		СообщениеПользователю.Текст = "Работа в программе будет происходить с ошибками!";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
	ВнешнийПользователь = новый COMОбъект("WScript.Network");
   
	ПараметрыСеанса.ВнешнийПользователь = СтрШаблон("Компьютер: %1, Пользователь: %2",ВнешнийПользователь.ComputerName,ВнешнийПользователь.UserName);
	
	//WshShell  = Новый COMОбъект("Wscript.Shell");
	//ИмяКомпьютера = WshShell.ExpandEnvironmentStrings("%computername%");
	//Сообщить(ИмяКомпьютера);
	
КонецПроцедуры // УстановитьТеущегоПользователя()