
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаВвода = НачалоДня(ТекущаяДата());
	
	ЗаполнитьОборудование();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОборудование()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОборудорваниеДляОтпечатаныхЛистов.Проведен КАК Проведен,
		|	ОборудорваниеДляОтпечатаныхЛистов.Дата КАК Дата,
		|	ОборудорваниеДляОтпечатаныхЛистов.СписокОборудования.(
		|		Оборудование КАК Оборудование,
		|		РазмерЛиста КАК РазмерЛиста,
		|		ЦветПечати КАК ЦветПечати
		|	) КАК СписокОборудования
		|ИЗ
		|	Документ.ОборудорваниеДляОтпечатаныхЛистов КАК ОборудорваниеДляОтпечатаныхЛистов
		|ГДЕ
		|	ОборудорваниеДляОтпечатаныхЛистов.Проведен = ИСТИНА
		|	И ОборудорваниеДляОтпечатаныхЛистов.Дата <= &ДатаВвода";
	
	Запрос.УстановитьПараметр("ДатаВвода",Объект.ДатаВвода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОБъект.СписокОборудования.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВыборкаСписокОборудования = ВыборкаДетальныеЗаписи.СписокОборудования.Выбрать();
		Пока ВыборкаСписокОборудования.Следующий() Цикл 
			НоваяСтрока = Объект.СписокОборудования.Добавить();	
			НоваяСтрока.Оборудование = ВыборкаСписокОборудования.Оборудование;
			НоваяСтрока.Размещение = ВыборкаСписокОборудования.Оборудование.Размещение;
			НоваяСтрока.Изготовитель = ВыборкаСписокОборудования.Оборудование.Изготовитель;
			НоваяСтрока.АдресОборудования = ВыборкаСписокОборудования.Оборудование.ИПАдрес;
			НоваяСтрока.РазмерЛиста = ВыборкаСписокОборудования.РазмерЛиста;
			НоваяСтрока.ЦветПечати = ВыборкаСписокОборудования.ЦветПечати;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьОборудование()

&НаКлиенте
Процедура СписокОборудованияАдресОборудованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке("http://"+СокрЛП(Элемент));

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОборудованиеНаКлиенте(Команда)
	
	ЗаполнитьОборудование();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписиНаСервере()
	
	Если Объект.СписокОборудования.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЖурналОтпечатаныхЛистов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Объект.ДатаВвода);
	Для Каждого СтрокаТаблицыОборудование Из Объект.СписокОборудования Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Период = Объект.ДатаВвода;
		Запись.Оборудование = СтрокаТаблицыОборудование.Оборудование;
		Запись.РазмерЛиста = СтрокаТаблицыОборудование.РазмерЛиста;
		Запись.ЦветПечати = СтрокаТаблицыОборудование.ЦветПечати;
		Запись.КоличествоОтпечатанных = СтрокаТаблицыОборудование.КоличествоОтпечатанных;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписи(Команда)
	
	СоздатьЗаписиНаСервере();
	Сообщить("Создано записей "+Объект.СписокОборудования.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОборудованияАдресОборудованияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокОборудованияАдресОборудования" Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке("http://"+СокрЛП(Элемент.ТекущиеДанные.АдресОборудования));	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписиНаСервере()
	
	НаборЗаписей = РегистрыСведений.ЖурналОтпечатаныхЛистов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Объект.ДатаВвода);
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписи(Команда)
	УдалитьЗаписиНаСервере();
КонецПроцедуры
