
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОбслуживаниеОборудования
	Движения.ОбслуживаниеОборудования.Записывать = Истина;
	Для Каждого ТекСтрокаРабота Из Работа Цикл
		Движение = Движения.ОбслуживаниеОборудования.Добавить();
		Движение.Оборудование = Оборудование;
		Движение.ВидОбслуживания = ВидОбслуживания;
		Движение.Номенклатура = ТекСтрокаРабота.Номенклатура;
		Движение.Работа = ТекСтрокаРабота.Работа;
		Движение.Период = Дата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не Проведен Тогда
		Если Работа.Количество()=0 Тогда
			НоваяСтрока = Работа.Добавить();
			НоваяСтрока.Работа = СокрЛП(ВидОбслуживания.Наименование)+". "+СокрЛП(Описание);
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры
