
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Договора
	Движения.Договора.Записывать = Истина;
	Для Каждого ТекСтрокаПрограммныеПродукты Из ПрограммныеПродукты Цикл
		Движение = Движения.Договора.Добавить();
		Движение.Период = Дата;
		Движение.ПрограммныйПродукт = ТекСтрокаПрограммныеПродукты.ПрограммныйПродукт;
		Движение.Контрагент = Контрагент;
		Движение.Количество = ТекСтрокаПрограммныеПродукты.Количество;
		Движение.СуммаПоДоговору = ТекСтрокаПрограммныеПродукты.СуммаСНДС;
		Движение.ДатаНачала = Дата;
		Движение.ДатаОкончания = ДатаОкончания;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
