
&НаСервереБезКонтекста
Процедура ОбновитьСтатусЗадач(МассивЗадач, НовыйСтатус)
	
	Для Каждого ТекущаяЗадача Из МассивЗадач Цикл
		
		ЗадачаОбъект = ТекущаяЗадача.ПолучитьОбъект();
		Если ЗадачаОбъект.СостояниеЗадачи=НовыйСтатус Тогда
			Продолжить;
		КонецЕсли;
		
		ЗадачаОбъект.СостояниеЗадачи = НовыйСтатус;
		
		Если НовыйСтатус = Перечисления.СостоянияЗадачи.Готова Тогда
			ЗадачаОбъект.Выполнена = Истина;
		КонецЕсли;
		
		Попытка
			ЗадачаОбъект.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не удалось изменить статус задачи" + ТекущаяЗадача + " по причине: "+ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыЗадачКлиент(МассивЗадач,Статус)
	
	Если ТипЗнч(МассивЗадач)=Тип("Массив") Тогда
		ОбновитьСтатусЗадач(МассивЗадач, Статус);
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиПользователю"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоваяПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	ОбновитьСтатусыЗадачКлиент(МассивЗадач, ПредопределенноеЗначение("Перечисление.СостоянияЗадачи.Новая"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	ОбновитьСтатусыЗадачКлиент(МассивЗадач, ПредопределенноеЗначение("Перечисление.СостоянияЗадачи.ВРаботе"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтложенаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	ОбновитьСтатусыЗадачКлиент(МассивЗадач, ПредопределенноеЗначение("Перечисление.СостоянияЗадачи.Отложена"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокГотоваПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	ОбновитьСтатусыЗадачКлиент(МассивЗадач, ПредопределенноеЗначение("Перечисление.СостоянияЗадачи.Готова"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВсеЗадачи(Команда)
	
	ОткрытьФорму("Задача.ЗадачиПользователю.Форма.ФормаСпискаВсеЗадачи");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоваяНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	// Вставить содержимое обработчика.
КонецПроцедуры
