
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.РегистрКомандировочных.Записывать = Истина;
	Движение = Движения.РегистрКомандировочных.Добавить();
	Движение.Период = Дата;
	Движение.НомерПриказа = НомерПриказа;
	Движение.ДатаПриказа = ДатаПриказа;
	Движение.ЦельКомандировки = ЦельКомандировки;
	Движение.КудаКомандировать = КудаКомандировать;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	НомерПриказа = "";
	ДатаПриказа = Дата(1,1,1,0,0,0);
КонецПроцедуры


