Функция ЗаменаКавычек(ПередоваемаяСтрока) Экспорт 
	
	     Если Не ЗначениеЗаполнено(ПередоваемаяСтрока) Тогда
         Возврат ПередоваемаяСтрока;
     КонецЕсли;
 
     ДвойнаяКавычка = """";
     КоличествоКавычек = СтрЧислоВхождений(ПередоваемаяСтрока, ДвойнаяКавычка);
 
     // Если количество кавычек меньше двух, ничего не делаем, так как нет смысла закрывать/открывать
     Если КоличествоКавычек < 2 Тогда
         Возврат ПередоваемаяСтрока;
     КонецЕсли;
 
     ЛеваяКавычка = "“";
     ПраваяКавычка = "”";
     БуквыИЦифры = "0123456789ABCDEFGHIKLMNJOPQRSTUVWXYZ";
     БуквыИЦифры = БуквыИЦифры + "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
 
     Результат = "";
     ПозицияКавычки = Найти(ПередоваемаяСтрока, ДвойнаяКавычка);
     Пока ПозицияКавычки > 0 Цикл
         Если ПозицияКавычки = СтрДлина(ПередоваемаяСтрока) Тогда
             // Если конец строки заканчивается кавычкой
             ПередоваемаяСтрока = Лев(ПередоваемаяСтрока, ПозицияКавычки - 1) + ПраваяКавычка; //
         Иначе
             // Если впереди кавычки идут буквы и цифры, - ставим открывающую "“"
             // Если любые другие символы, - ставим закрывающую "”"
             СледующийСимвол = ВРег(Сред(ПередоваемаяСтрока, ПозицияКавычки + 1, 1));
             СтрокаЗамены = ?((Найти(БуквыИЦифры, СледующийСимвол) > 0) Или (ПозицияКавычки = 1), ЛеваяКавычка, ПраваяКавычка); //
             ПередоваемаяСтрока = Лев(ПередоваемаяСтрока, ПозицияКавычки - 1) + СтрокаЗамены + Сред(ПередоваемаяСтрока, ПозицияКавычки + 1); //
         КонецЕсли;
         // Если количество кавычек после последней замены осталось меньше двух, ничего не делаем, так как нет смысла закрывать/открывать
         КоличествоКавычек = СтрЧислоВхождений(ПередоваемаяСтрока, ДвойнаяКавычка);
         Если СтрокаЗамены = ПраваяКавычка И КоличествоКавычек < 2 Тогда
             ПозицияКавычки = 0;
         Иначе
             ПозицияКавычки = Найти(ПередоваемаяСтрока, ДвойнаяКавычка);
         КонецЕсли;
     КонецЦикла;
 
     Возврат ПередоваемаяСтрока;
КонецФункции