
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроведениеКомандировоных();
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОтменаПроведенияКомандировоных();
	КонецЕсли;
КонецПроцедуры

Процедура ПроведениеКомандировоных()
	
	ТаблицаКоманд = ЭтотОбъект.ВыбранныеПриказы.Выгрузить();
	
	Для Каждого Стр Из ТаблицаКоманд Цикл
		СсылкаНаКоманд = Стр.НазваниеКомандировки.Ссылка;
		ПолученныйКом = СсылкаНаКоманд.ПолучитьОбъект();
		ПолученныйКом.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;

	
КонецПроцедуры

Процедура ОтменаПроведенияКомандировоных() 
	
	ТаблицаКоманд = ЭтотОбъект.ВыбранныеПриказы.Выгрузить();
	
	Для Каждого Стр Из ТаблицаКоманд Цикл
		СсылкаНаКоманд = Стр.НазваниеКомандировки.Ссылка;
		ПолученныйКом = СсылкаНаКоманд.ПолучитьОбъект();
		ПолученныйКом.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ВыбранныеПриказы.Очистить();
	НомерПриказа = "";
	ДатаПриказа = Дата(1,1,1);
	ПриказСПродлением = Ложь;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Для Каждого Стр из ВыбранныеПриказы Цикл
		ДокСсылка = Стр.НазваниеКомандировки;
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		ДокОбъект.НомерПриказа = "";
		ДокОбъект.ДатаПриказа = Дата(1,1,1,0,0,0);
		ДокОбъект.Записать();
	КонецЦикла;
КонецПроцедуры


