
&НаСервере
Функция ПолучитьПрофильПочты() Экспорт
	
	Профиль = Новый ИнтернетПочтовыйПрофиль; 
	Профиль.АдресСервераSMTP = ОбщегоНазначенияНаСервере.ПолучитьЗначениеКонстанты("АдресСервераSMTP");
	Профиль.ПортSMTP = ОбщегоНазначенияНаСервере.ПолучитьЗначениеКонстанты("ПортSMTP");
	Профиль.Пользователь = ОбщегоНазначенияНаСервере.ПолучитьЗначениеКонстанты("ПользовательSMTP");
	Профиль.Пароль = ОбщегоНазначенияНаСервере.ПолучитьЗначениеКонстанты("ПарольSMTP");
	Профиль.ПользовательSMTP =  ОбщегоНазначенияНаСервере.ПолучитьЗначениеКонстанты("ПользовательSMTP");
	Профиль.ПарольSMTP = ОбщегоНазначенияНаСервере.ПолучитьЗначениеКонстанты("ПарольSMTP");
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Профиль.ИспользоватьSSLPOP3 = ОбщегоНазначенияНаСервере.ПолучитьЗначениеКонстанты("ИспользоватьSSLPOP3");
	Профиль.ИспользоватьSSLSMTP = ОбщегоНазначенияНаСервере.ПолучитьЗначениеКонстанты("ИспользоватьSSLSMTP");
	
	Возврат Профиль;
	
КонецФункции