
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда Возврат; КонецЕсли;
	Если ТекстИзменен Тогда
		Отказ = Истина;
		ОбратныйВызов = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОбратныйВызов, НСтр("ru = 'Сохранить изменения текста?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик ответа на вопрос перед закрытием формы.
//
// Параметры:
//	Результат				- КодВозвратаДиалога	- Ответ на вопрос.
//	ДополнительныеПараметры	- Структура				- Структура дополнительных параметров.
//
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьИзмененияТекста();
    КонецЕсли;
	ТекстИзменен	= Ложь;
	Закрыть();
КонецПроцедуры // ПередЗакрытиемЗавершение()

&НаКлиенте
// Процедура оповещает владельца текста об его изменении.
//
// Параметры:
//	Нет.
//
Процедура ЗаписатьИзмененияТекста()
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Сотрудник",	Запись.Сотрудник);
	Оповестить("Новый_ОтветственноеЛицо", СтруктураВозврата, ВладелецФормы);

	ТекстИзменен = Ложь;
	
КонецПроцедуры // ЗаписатьИзмененияТекста()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстИзменен = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ТекстИзменен = Истина;
	
КонецПроцедуры
