
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.ЦветПечати = Перечисления.ЦветПечати.ЧерноБелый;
		Запись.РазмерЛиста = Перечисления.РазмерыЛиста.А4;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаПерейтиПоАдресуНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиПоАдресу(Команда)
	КомандаПерейтиПоАдресуНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьИПАдрес(Оборудование)
	
	ОбъектОборудование = Оборудование.ПолучитьОбъект();
	Возврат ОбъектОборудование.ИПАдрес;
	
КонецФункции

&НаКлиенте
Процедура ИПАдресНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке("http://"+СокрЛП(ПолучитьИПАдрес(Запись.Оборудование)));
	
КонецПроцедуры
