
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Подразделение");
	ПолеОтбораСотруд = Новый ПолеКомпоновкиДанных("Сотрудник");
	
	НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
	ЭлементОтбора.ЛевоеЗначение = ПолеОтбораСотруд;
	
	Если ПараметрыСеанса.ТекущийПользователь.Пользователь = Истина Тогда
		НовыйЭлементОтбора.Использование = Истина;
		ЭлементОтбора.Использование = Ложь;
	Иначе
		НовыйЭлементОтбора.Использование = Ложь;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
	
	НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
КонецПроцедуры



