
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Ключ.Пустая() Тогда
		СписокОбслуживания.Параметры.УстановитьЗначениеПараметра("Оборудование",Справочники.Оборудование.ПустаяСсылка());	
	Иначе
		СписокОбслуживания.Параметры.УстановитьЗначениеПараметра("Оборудование",Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаИсторияОтветственныхЛицНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаИсторияОтветственныхЛиц(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		Записать();
	КонецЕсли;
	 
	ПараметрыОткрытия = Новый Структура;
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Период",ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Оборудование",Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения",ПараметрыЗаполнения);
	ОткрытьФорму(
				"РегистрСведений.ОтветственныеЛицаОборудования.ФормаСписка",
				ПараметрыОткрытия,
				ЭтаФорма,
				,,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Процедура КомандаНовыйОтветственноеЛицоНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаНовыйОтветственноеЛицо(Команда)
	//КомандаНовыйОтветственноеЛицоНаСервере();
	
	Если Параметры.Ключ.Пустая() Тогда
		Записать();
	КонецЕсли;
	 
	ПараметрыОткрытия = Новый Структура;
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Период",ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Оборудование",Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения",ПараметрыЗаполнения);
	ОткрытьФорму(
				"РегистрСведений.ОтветственныеЛицаОборудования.ФормаЗаписи",
				ПараметрыОткрытия,
				ЭтаФорма,
				,,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия="Новый_ОтветственноеЛицо") И (Источник = ЭтаФорма) Тогда
		Объект.ОтветственноеЛицо = Параметр.Сотрудник;
		Модифицированность = Истина;
		Записать();
	КонецЕсли;
	
КонецПроцедуры
